In [1]:
import pandas as pd

In [27]:
# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

In [28]:
years = df.year.unique()

In [29]:
type(years)

numpy.ndarray

In [30]:
len(years)

3

In [32]:
# Category level 1 to level 2. Input for level 2 category training
name={}
for i in range(len(years)):
    name[i] = df.loc[df.year==years[i]]

#d = {name: pd.DataFrame() for name in companies}

In [46]:
name

{0:           name  reports  year
 Cochice  Jason        4  2012
 Pima     Molly       24  2012, 1:             name  reports  year
 Santa Cruz  Tina       31  2013, 2:           name  reports  year
 Maricopa  Jake        2  2014
 Yuma       Amy        3  2014}

In [53]:
reports_series = name[0].reports.unique()

In [54]:
reports_series

array([ 4, 24], dtype=int64)

In [38]:
dict2={}
for i in range(len(years)):
    dict2[i] = {}

In [39]:
dict2

{0: {}, 1: {}, 2: {}}

In [71]:
# Category level 2 to 3. Input for level 3 category training

for i in range(len(years)):
    for j in range(len(name[i].reports.unique())):
        print(i, j)
        reports_series = name[i].reports.unique()
        print(reports_series)
        dict2[i][j] = name[i].loc[name[i].reports == reports_series[j]]
        #print(dict2[i][j])

0 0
[ 4 24]
0 1
[ 4 24]
1 0
[31]
2 0
[2 3]
2 1
[2 3]

In [72]:
dict2[0][0]

          name  reports  year
Cochice  Jason        4  2012

In [62]:
dict2[0][1]

       name  reports  year
Pima  Molly       24  2012

In [73]:
dict2[1][0]

            name  reports  year
Santa Cruz  Tina       31  2013

In [74]:
dict2[2][0]

          name  reports  year
Maricopa  Jake        2  2014

In [75]:
dict2[2][1]

     name  reports  year
Yuma  Amy        3  2014

In [ ]:
df3_dict[]

In [ ]:
len(name[2].reports.unique())

In [ ]:
name[0]

In [ ]:
type(reports_len)

In [ ]:
name[0].reports == reports_len[0]

In [ ]:
len(name[0].reports.unique())